# 계수정렬
# 특정한 조건이 부합할 때만 사용할 수 있지만 매우 빠르게 동작하는 정렬 알고리즘입니다.
# 계수 정렬은 데이터의 크기 범위가 제한되어 정수 형태로 표현할 수 있을 때 사용 가능합니다.
# 데이터의 개수가 N, 데이터(양수) 중 최댓값이 K일 때 최악의 경우에도 수행 시간 O(n+k)를 보장 ㄷㄷ
# 인덱스와 같은 데이터의 갯수를 세는거임

#모든 원소의 값이 0보다 크거나 같다고 가정
array = [7, 5, 9, 0, 3, 1, 6, 2, 9, 1, 4, 8, 0, 5, 2]
# 모든 범위를 포함하는 리스트 선언(모든 값은 0으로 초기화)
count = [0] * (max(array) + 1) # 가장 큰 값이 9니까 +1 을 한 10만큼의 크기를 가진 카운터 배열 생성

for i in range(len(array)):
    count[array[i]] += 1 # 각 데이터에 해당하는 인덱스의 값 증가

for i in range(len(count)): # 리스트에 기록된 정렬 정보 확인
    for j in range(count[i]):
        print(i, end = ' ') # 띄어쓰기를 구분으로 등장한 횟수만큼 인덱스 출력

# 시간 복잡도, 공간 복잡도 O(n+k)
# 계수정렬은 가끔 심각한 비효율성을 초래한다.
# 계수정렬은 동일한 값을 데이터가 여러 개 등장할 때 효과적으로 사용할 수 있습니다.